public_html/other/robot.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2017-10-17 Вт 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Условие задачи</a></li>
<li><a href="#sec-2">2. Входные данные</a></li>
<li><a href="#sec-3">3. Генерация тестового сценария</a></li>
<li><a href="#sec-4">4. Отладочный вывод</a></li>
<li><a href="#sec-5">5. Решение задачи</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Условие задачи</h2>
<div class="outline-text-2" id="text-1">
<p>
Существует плоскость, разделенная на клетки.
</p>

<p>
Каждая клетка может быть:
</p>
<ul class="org-ul">
<li>пустой
</li>
<li>заполненной грузом (одна или несколько единиц)
</li>
<li>содержать робота
</li>
</ul>

<p>
Робот может ходить по всем клеткам, кроме тех, что содержат
груз. Движение дискретно с шагом длины - 1 клетка.
</p>

<p>
Робот может поднять одну единицу груза, если этот груз находится в
соседней с ним клетке.
</p>

<p>
Если робот имеет груз - он может опустить одну единицу груза в
соседнюю с ним клетку
</p>

<p>
Найти последовательность действий робота для перемещения всех грузов
в заданную клетку
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Входные данные</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Координаты грузов на матрице
</li>
<li>Начальные координаты робота
</li>
<li>Координаты целевой клетки
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Генерация тестового сценария</h2>
<div class="outline-text-2" id="text-3">
<p>
Тестовый сценарий представляет собой прямоугольное поле со сторонами
<code>width</code> и <code>height</code>, на котором:
</p>
<ul class="org-ul">
<li>пустые точки обозначены <code>0</code>
</li>
<li>точки с грузом обозначены <code>1</code>
</li>
<li>робот обозначен <code>2</code>
</li>
<li>точка сброса груза обозначена <code>3</code>
</li>
<li>робот с грузом обозначен <code>4</code>
</li>
<li>посещенное состояние обозначим <code>5</code>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-lisp" id="gen_suite">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">gen-suite</span> (height width count)
  (<span style="color: #af00ff;">let</span> ((field (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> y <span style="color: #5f5f87;">:from</span> 0 <span style="color: #5f5f87;">:to</span> (- height 1) <span style="color: #5f5f87;">:collect</span>
                  (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> x <span style="color: #5f5f87;">:from</span> 0 <span style="color: #5f5f87;">:to</span> (- width 1) <span style="color: #5f5f87;">:collect</span>
                     0))))
    (<span style="color: #af00ff;">macrolet</span> ((put-in-free-cell (val)
                 `(<span style="color: #af00ff;">tagbody</span>
                   repeat
                     (<span style="color: #af00ff;">let</span> ((y (random height))
                           (x (random width)))
                       (<span style="color: #af00ff;">if</span> (equal 0 (nth x (nth y field)))
                           (setf (nth x (nth y field)) ,val)
                           (<span style="color: #af00ff;">go</span> repeat))))))
      (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> c <span style="color: #5f5f87;">:from</span> 0 <span style="color: #5f5f87;">:to</span> (- count 1) <span style="color: #5f5f87;">:do</span>
         (put-in-free-cell 1))
      (put-in-free-cell 2)
      (put-in-free-cell 3))
    field))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">(gen-suite 5 5 3)</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">=&gt; ((0 0 0 0 3) (0 1 0 0 0) (0 0 0 0 0) (0 0 0 0 0) (1 1 0 0 2))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Отладочный вывод</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-lisp" id="dbg">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">dbg</span> (suite)
  (format t <span style="color: #87005f;">"~{~A~}~%"</span>
          (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> y <span style="color: #5f5f87;">:from</span> 0 <span style="color: #5f5f87;">:to</span> (length suite) <span style="color: #5f5f87;">:collect</span>
             (format nil <span style="color: #87005f;">"~{~A~^.~}~%"</span> (nth y suite)))))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">(dbg (gen-suite 5 5 3))</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">=&gt;</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">0.0.0.0.0</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">0.0.0.1.0</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">1.0.0.0.0</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">0.0.2.0.0</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">0.1.0.3.0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Решение задачи</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-lisp" id="solver">(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*suite*</span> (gen-suite 5 5 3))

(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">all-outer-cells</span> (y x)
  (list (cons (- y 1) (- x 1))
        (cons (- y 1) (- x 0))
        (cons (- y 1) (+ x 1))
        (cons (- y 0) (- x 1))
        (cons (- y 0) (+ x 1))
        (cons (+ y 1) (- x 1))
        (cons (+ y 1) (- x 0))
        (cons (+ y 1) (+ x 1))))

(<span style="color: #af00ff;">defmacro</span> <span style="color: #0000ff;">cell</span> (y x suite)
  `(nth ,x (nth ,y ,suite)))

(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">solver</span> (suite)
  (dbg suite)
  <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1087;&#1086;&#1083;&#1103;</span>
  (<span style="color: #af00ff;">let</span> ((height (length suite))
        (width  (length (car suite))))
    (<span style="color: #af00ff;">flet</span> (<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1091;&#1102;&#1097;&#1072;&#1103; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1084;&#1080; &#1076;&#1086;&#1089;&#1082;&#1080;</span>
           (impossible (z)
             (or (&gt; 0 (car z))
                 (&gt; 0 (cdr z))
                 (&lt; (- height 1) (car z))
                 (&lt; (- width 1) (cdr z)))))
      <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1053;&#1072;&#1093;&#1086;&#1076;&#1080;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1088;&#1086;&#1073;&#1086;&#1090;&#1072; &#1074; &#1085;&#1077;&#1084;</span>
      (<span style="color: #af00ff;">let</span> ((robot-y) (robot-x))
        (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> y <span style="color: #5f5f87;">:from</span> 0 <span style="color: #5f5f87;">:to</span> (- height 1) <span style="color: #5f5f87;">:collect</span>
           (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> x <span style="color: #5f5f87;">:from</span> 0 <span style="color: #5f5f87;">:to</span> (- width 1) <span style="color: #5f5f87;">:collect</span>
              (<span style="color: #af00ff;">when</span> (equal 2 (nth x (nth y suite)))
                (setf robot-y y)
                (setf robot-x x))))
        (<span style="color: #af00ff;">when</span> (null robot-y) <span style="color: #af0000;">;; </span><span style="color: #af0000;">defence</span>
          (<span style="color: #ff0000; font-weight: bold;">error</span> 'no-robot-in-field))
        (<span style="color: #af00ff;">let*</span> ((nears (remove-if #'impossible (all-outer-cells robot-y robot-x)))
               (near-cargo? (<span style="color: #af00ff;">block</span> near-cargo-block
                              (mapcar #'(<span style="color: #af00ff;">lambda</span> (z)
                                          (<span style="color: #af00ff;">when</span> (equal 1 (cell (car z) (cdr z) suite))
                                            (<span style="color: #af00ff;">return-from</span> near-cargo-block z)))
                                      nears)
                              nil)))
          (<span style="color: #af00ff;">if</span> near-cargo?
              <span style="color: #af0000;">;; </span><span style="color: #af0000;">then - pick up cargo and recurr</span>
              (values
               (setf (cell (cdr near-cargo?) (car near-cargo?) suite) 0)
               (setf (cell (cdr near-cargo?) (car near-cargo?) suite) 4)
               <span style="color: #af0000;">;; </span><span style="color: #af0000;">(solver suite)</span>
               )
              <span style="color: #af0000;">;; </span><span style="color: #af0000;">(values robot-y robot-x near-cargo?)</span>
              <span style="color: #af0000;">;; </span><span style="color: #af0000;">else</span>
              (<span style="color: #af00ff;">if</span> (null nears)
                  (print 'fail)
                  (<span style="color: #af00ff;">progn</span>
                    (setf (cell robot-y robot-x suite) 5)
                    (<span style="color: #af00ff;">loop</span> <span style="color: #5f5f87;">:for</span> z <span style="color: #5f5f87;">:in</span> nears <span style="color: #5f5f87;">:do</span>
                       (<span style="color: #af00ff;">let</span> ((tmp-suite (copy-tree suite)))
                         (setf (cell (car z) (cdr z) tmp-suite) 2)
                         (dbg tmp-suite)))))))))))

(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*suite*</span> (gen-suite 5 5 3))
(solver *suite*)

(<span style="color: #af00ff;">defmacro</span> <span style="color: #0000ff;">eval-always</span> (<span style="color: #008700;">&amp;body</span> body)
  `(<span style="color: #af00ff;">eval-when</span> (<span style="color: #5f5f87;">:compile-toplevel</span> <span style="color: #5f5f87;">:load-toplevel</span> <span style="color: #5f5f87;">:execute</span>)
     ,@body))

(eval-always
  (<span style="color: #af00ff;">defmacro</span> <span style="color: #0000ff;">and-it</span> (<span style="color: #008700;">&amp;rest</span> args)
    <span style="color: #87005f;">"Like AND. IT is bound to the value of the previous AND form."</span>
    (<span style="color: #af00ff;">cond</span> ((null args) t)
          ((null (cdr args)) (car args))
          (t `(<span style="color: #af00ff;">when-it</span> ,(car args) (and-it ,@(cdr args)))))))

(<span style="color: #af00ff;">defmacro</span> <span style="color: #0000ff;">maybecall</span> (val <span style="color: #008700;">&amp;rest</span> funs)
  `(and-it ,val
           ,@(mapcar (<span style="color: #af00ff;">lambda</span> (fun)
                       `(funcall ,fun it))
                     funs)))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2017-10-17 Вт 16:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
